Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипКонтрагента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактныйТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРожденияКлиента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолКлиента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Покупатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Клиент</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Контрагенты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытий
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ТипКонтрагентаПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	Если Объект.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Клиент") Тогда
		Элементы.ДатаРожденияКлиента.Видимость = Истина; 
		Элементы.КонтактныйТелефон.Видимость = Истина;
		Элементы.ПолКлиента.Видимость = Истина;  
		Элементы.Источник.Видимость = Истина;
		Элементы.ДоговорКонтрагента.Видимость = Ложь;
		Элементы.Наименование.Заголовок = "Ф.И.О.";
	Иначе
		Элементы.ДатаРожденияКлиента.Видимость = Ложь; 
		Элементы.ПолКлиента.Видимость = Ложь;  
		Элементы.Источник.Видимость = Ложь;
		Элементы.ДоговорКонтрагента.Видимость = Истина;
		Элементы.Наименование.Заголовок = "Наименование";
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
